package com.example.hits2025_java_missed_classes.service;

public class StudentService {
    // TODO: добавление в группу студента
    // TODO: добавление в подгруппу стедента
    // TODO: подумать как сделать 2 верхние функции тк на это один и тот же ендпоинт

    // TODO: удаление из группы или подгруппы - предполагать что если указана подгруппа, то удалить только из подгруппы а в группе оставить? опять таки как должен работать ендпоинт?

    // TODO: получение списка студентов по фильтрам - на это 2 эндпоинта - разобраться в них
}
